In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data = {
    'Name' : ["Siddhi", "Purva", "Nirja", "Jiya", "Zinku"],
    'Age' : [27, 31, 32, 19, 17],
    'Address' : ['Vyara', 'Mandvi', 'Kim', 'Magarkui', 'Magarkui']
}
df = pd.DataFrame(data)
df

In [ ]:
df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D', 'E'])
df

In [ ]:
pd.read_csv("googleplaystore_v2.csv")

In [ ]:
pd.read_excel("pandasss.xlsx")

In [21]:
help(pd.DataFrame.loc)

Help on property:

    Access a group of rows and columns by label(s) or a boolean array.

    ``.loc[]`` is primarily label based, but may also be used with a
    boolean array.

    Allowed inputs are:

    - A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
      interpreted as a *label* of the index, and **never** as an
      integer position along the index).
    - A list or array of labels, e.g. ``['a', 'b', 'c']``.
    - A slice object with labels, e.g. ``'a':'f'``.

      .. warning:: Note that contrary to usual python slices, **both** the
          start and the stop are included

    - A boolean array of the same length as the axis being sliced,
      e.g. ``[True, False, True]``.
    - An alignable boolean Series. The index of the key will be aligned before
      masking.
    - An alignable Index. The Index of the returned selection will be the input.
    - A ``callable`` function with one argument (the calling Series or
      DataFrame) and that returns valid output for indexing (one of the above)

    See more at :ref:`Selection by Label <indexing.label>`.

    Raises
    ------
    KeyError
        If any items are not found.
    IndexingError
        If an indexed key is passed and its index is unalignable to the frame index.

    See Also
    --------
    DataFrame.at : Access a single value for a row/column label pair.
    DataFrame.iloc : Access group of rows and columns by integer position(s).
    DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
        Series/DataFrame.
    Series.loc : Access group of values using labels.

    Examples
    --------
    **Getting values**

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=['cobra', 'viper', 'sidewinder'],
    ...      columns=['max_speed', 'shield'])
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4       5
    sidewinder          7       8

    Single label. Note this returns the row as a Series.

    >>> df.loc['viper']
    max_speed    4
    shield       5
    Name: viper, dtype: int64

    List of labels. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[['viper', 'sidewinder']]
                max_speed  shield
    viper               4       5
    sidewinder          7       8

    Single label for row and column

    >>> df.loc['cobra', 'shield']
    2

    Slice with labels for row and single label for column. As mentioned
    above, note that both the start and stop of the slice are included.

    >>> df.loc['cobra':'viper', 'max_speed']
    cobra    1
    viper    4
    Name: max_speed, dtype: int64

    Boolean list with the same length as the row axis

    >>> df.loc[[False, False, True]]
                max_speed  shield
    sidewinder          7       8

    Alignable boolean Series:

    >>> df.loc[pd.Series([False, True, False],
    ...        index=['viper', 'sidewinder', 'cobra'])]
                max_speed  shield
    sidewinder          7       8

    Index (same behavior as ``df.reindex``)

    >>> df.loc[pd.Index(["cobra", "viper"], name="foo")]
           max_speed  shield
    foo
    cobra          1       2
    viper          4       5

    Conditional that returns a boolean Series

    >>> df.loc[df['shield'] > 6]
                max_speed  shield
    sidewinder          7       8

    Conditional that returns a boolean Series with column labels specified

    >>> df.loc[df['shield'] > 6, ['max_speed']]
                max_speed
    sidewinder          7

    Callable that returns a boolean Series

    >>> df.loc[lambda df: df['shield'] == 8]
                max_speed  shield
    sidewinder          7       8

    **Setting values**

    Set value for all items matching the list of labels

    >>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4      50
    sidewinder          7      50

    Set value for an entire row

    >>> df.loc['cobra'] = 10
    >>> df
                max_speed  shield
    cobra              10      10
    viper               4      50
    sidewinder          7      50

    Set value for an entire column

    >>> df.loc[:, 'max_speed'] = 30
    >>> df
                max_speed  shield
    cobra              30      10
    viper              30      50
    sidewinder         30      50

    Set value for rows matching callable condition

    >>> df.loc[df['shield'] > 35] = 0
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       0
    sidewinder          0       0

    **Getting values on a DataFrame with an index that has integer labels**

    Another example using integers for the index

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=[7, 8, 9], columns=['max_speed', 'shield'])
    >>> df
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    Slice with integer labels for rows. As mentioned above, note that both
    the start and stop of the slice are included.

    >>> df.loc[7:9]
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    **Getting values with a MultiIndex**

    A number of examples using a DataFrame with a MultiIndex

    >>> tuples = [
    ...    ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ...    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ...    ('viper', 'mark ii'), ('viper', 'mark iii')
    ... ]
    >>> index = pd.MultiIndex.from_tuples(tuples)
    >>> values = [[12, 2], [0, 4], [10, 20],
    ...         [1, 4], [7, 1], [16, 36]]
    >>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
    >>> df
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Single label. Note this returns a DataFrame with a single index.

    >>> df.loc['cobra']
             max_speed  shield
    mark i          12       2
    mark ii          0       4

    Single index tuple. Note this returns a Series.

    >>> df.loc[('cobra', 'mark ii')]
    max_speed    0
    shield       4
    Name: (cobra, mark ii), dtype: int64

    Single label for row and column. Similar to passing in a tuple, this
    returns a Series.

    >>> df.loc['cobra', 'mark i']
    max_speed    12
    shield        2
    Name: (cobra, mark i), dtype: int64

    Single tuple. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[[('cobra', 'mark ii')]]
                   max_speed  shield
    cobra mark ii          0       4

    Single tuple for the index with a single label for the column

    >>> df.loc[('cobra', 'mark i'), 'shield']
    2

    Slice from index tuple to single label

    >>> df.loc[('cobra', 'mark i'):'viper']
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Slice from index tuple to index tuple

    >>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
                        max_speed  shield
    cobra      mark i          12       2
               mark ii          0       4
    sidewinder mark i          10      20
               mark ii          1       4
    viper      mark ii          7       1

In [22]:
df['Name']

A    Siddhi
B     Purva
C     Nirja
D      Jiya
E     Zinku
Name: Name, dtype: object

In [23]:
df[['Age', 'Address']]

   Age   Address
A   27     Vyara
B   31    Mandvi
C   32       Kim
D   19  Magarkui
E   17  Magarkui

In [24]:
df[1:4]

    Name  Age   Address College Name
B  Purva   31    Mandvi          DEF
C  Nirja   32       Kim          GHI
D   Jiya   19  Magarkui          JKL

In [25]:
df[0:1]

     Name  Age Address College Name
A  Siddhi   27   Vyara          ABC

In [26]:
df[2:]

    Name  Age   Address College Name
C  Nirja   32       Kim          GHI
D   Jiya   19  Magarkui          JKL
E  Zinku   17  Magarkui          MNO

In [27]:
df[1:3]

    Name  Age Address College Name
B  Purva   31  Mandvi          DEF
C  Nirja   32     Kim          GHI

In [28]:
by = [1994, 1991, 1990, 2003, 2004]
df['Born Year'] = by
df

     Name  Age   Address College Name  Born Year
A  Siddhi   27     Vyara          ABC       1994
B   Purva   31    Mandvi          DEF       1991
C   Nirja   32       Kim          GHI       1990
D    Jiya   19  Magarkui          JKL       2003
E   Zinku   17  Magarkui          MNO       2004

In [29]:
clg = ['ABC', 'DEF', 'GHI', 'JKL', 'MNO']
df['College Name'] = clg
df

     Name  Age   Address College Name  Born Year
A  Siddhi   27     Vyara          ABC       1994
B   Purva   31    Mandvi          DEF       1991
C   Nirja   32       Kim          GHI       1990
D    Jiya   19  Magarkui          JKL       2003
E   Zinku   17  Magarkui          MNO       2004

In [30]:
df = df.drop(["Born Year"], axis=1)
df

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
B   Purva   31    Mandvi          DEF
C   Nirja   32       Kim          GHI
D    Jiya   19  Magarkui          JKL
E   Zinku   17  Magarkui          MNO

In [31]:
df.loc['A']

Name            Siddhi
Age                 27
Address          Vyara
College Name       ABC
Name: A, dtype: object

In [32]:
df.loc["C" : "E"]

    Name  Age   Address College Name
C  Nirja   32       Kim          GHI
D   Jiya   19  Magarkui          JKL
E  Zinku   17  Magarkui          MNO

In [33]:
df.loc["B"]

Name             Purva
Age                 31
Address         Mandvi
College Name       DEF
Name: B, dtype: object

In [34]:
df.loc[["A", "E"]]

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
E   Zinku   17  Magarkui          MNO

In [35]:
df.loc["F"] = ["Janu", 27, "Songadh"]
df

ValueError: cannot set a row with mismatched columns

In [36]:
df.loc["G"] = ["Juhi", 20, "Surat"]
df

ValueError: cannot set a row with mismatched columns

In [37]:
df = df.drop(['G'], axis = 0)
df

KeyError: "['G'] not found in axis"

In [38]:
df

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
B   Purva   31    Mandvi          DEF
C   Nirja   32       Kim          GHI
D    Jiya   19  Magarkui          JKL
E   Zinku   17  Magarkui          MNO

In [39]:
df.loc["F"] = ['Janu', 27, 'Songadh', 'PQR']
df

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
B   Purva   31    Mandvi          DEF
C   Nirja   32       Kim          GHI
D    Jiya   19  Magarkui          JKL
E   Zinku   17  Magarkui          MNO
F    Janu   27   Songadh          PQR

In [40]:
df.loc["G"] = ['Juhi', 20, 'Surat', 'STU']
df

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
B   Purva   31    Mandvi          DEF
C   Nirja   32       Kim          GHI
D    Jiya   19  Magarkui          JKL
E   Zinku   17  Magarkui          MNO
F    Janu   27   Songadh          PQR
G    Juhi   20     Surat          STU

In [41]:
df = df.drop(["G"], axis = 0)
df

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
B   Purva   31    Mandvi          DEF
C   Nirja   32       Kim          GHI
D    Jiya   19  Magarkui          JKL
E   Zinku   17  Magarkui          MNO
F    Janu   27   Songadh          PQR

In [42]:
df

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
B   Purva   31    Mandvi          DEF
C   Nirja   32       Kim          GHI
D    Jiya   19  Magarkui          JKL
E   Zinku   17  Magarkui          MNO
F    Janu   27   Songadh          PQR

In [53]:
df[['Name', 'Age']].loc[['A', 'D']]

     Name  Age
A  Siddhi   27
D    Jiya   19

In [52]:
df.loc[['A','C']]

     Name  Age Address College Name
A  Siddhi   27   Vyara          ABC
C   Nirja   32     Kim          GHI

In [54]:
df[['Address', 'College Name']].loc[['A', 'D']]

    Address College Name
A     Vyara          ABC
D  Magarkui          JKL

In [59]:
df[['Address', 'College Name']].loc[['A', 'D']]

    Address College Name
A     Vyara          ABC
D  Magarkui          JKL